[
  {
    "ironic": "Someone's brother-in-law must have just come up with a 'new, radical design' for the uniforms ...",
    "literal": "Someone's brother-in-law likely created a new design for the uniforms."
  },
  {
    "ironic": "I for one am in utter shock that these fine institutions would stoop to such a low level to deceive consumers and benefit themselves financially.   /s",
    "literal": "I am not surprised that these institutions would deceive consumers to benefit themselves financially."
  },
  {
    "ironic": "NO WAY ! \n\nThe Nobel Peace Prize winning MESSiah would never do such a thing !",
    "literal": "The Nobel Peace Prize winner might actually do such a thing."
  },
  {
    "ironic": "Yeah, Fuck freedom of religion!  Free healthcare, my employer, that I **chose** to work for, is forced to pay for, is more important than that!",
    "literal": "Freedom of religion is important, but I believe that having my employer provide free healthcare is more important."
  },
  {
    "ironic": "&gt;&gt;\"It's not radical, its not extreme cause we all believe it\"\n\nThat's pretty hilarious...  \nYes you are all radicals.",
    "literal": "It's radical and extreme because not everyone believes it. Yes, you are all radicals."
  },
  {
    "ironic": "Liberals: \"We ran a black guy so we can't be racist! \"\n\nTea Party: \"We ran a guy with a 9-9-9 tax plan that will help the economy!  He also has great business experience! \"\n\nMedia: The Tea Party functions solely around racist issues.",
    "literal": "Liberals: \"We supported a black candidate to demonstrate that we are not racist.\"\n\nTea Party: \"We supported a candidate with a 9-9-9 tax plan to improve the economy. He also has significant business experience.\"\n\nMedia: The Tea Party is primarily concerned with issues related to racism."
  },
  {
    "ironic": "It jumped the shark when it stopped being about fiscal responsibility and became about socialism is evil, this is a Christian nation, and \"STOPSPENDINGSTOPSPENDINGSTOPSPENDING\" became their main policy while all they really did was pass abortion bills. \n\nYou know, 3 days after it started.",
    "literal": "It lost focus on fiscal responsibility and shifted to opposing socialism, promoting the idea of a Christian nation, and prioritizing excessive spending reduction. Despite this, their main actions were passing abortion bills, which happened very soon after it began."
  },
  {
    "ironic": "Maybe Ken Cuccinelli Shouldn't Have Built His Campaign Around Sodomy.... because he sucks! \n\n**rimshot**\n\nthanks folks, i'll be here all week!",
    "literal": "Ken Cuccinelli's campaign focused on sodomy was a poor choice because it was ineffective. Thank you for your attention. I'll be here all week."
  },
  {
    "ironic": "Well if we did it to them, we woul be in trouble... \nSO LET'S STIR UP SHIT!",
    "literal": "If we did it to them, we would be in trouble, so let's cause problems."
  },
  {
    "ironic": "Hey, in his defense the original constitution had no problem with slavery and put women in a lower social class.  Sounds biblical to me...",
    "literal": "The original constitution accepted slavery and placed women in a lower social class, which aligns with some biblical interpretations."
  },
  {
    "ironic": "I wish.  And if it is really happening it will be interpreted by some hardcore religious blockheads as God's intention when he/she/it realized we were not worthy of worshiping him.. Of course, he/she/it knew it from the start.",
    "literal": "I hope it happens. If it does, some religious people might interpret it as God's intention because they believe humanity is unworthy of worshiping God. They think God knew this from the beginning."
  },
  {
    "ironic": "Yes, expand the pyramid scheme...",
    "literal": "No, do not expand the pyramid scheme."
  },
  {
    "ironic": "I honestly do not know if this article is for real... no one is that stupid... right??",
    "literal": "I am unsure if this article is genuine because I find it hard to believe someone could be that ignorant."
  },
  {
    "ironic": "Oh sure, Clinton at 61 percent makes perfect sense... Could anyone possibly have any mysterious insight?",
    "literal": "Why on Earth is Clinton at 61 percent?  Could anyone provide some insight?"
  },
  {
    "ironic": "Oh sure, Chrome is minimalistic purely for its own sake... that's not at all annoying, especially with those wonderfully subtle Google 'service' tie-ins... And of course, FF? Yeah right, who'd ever think that's the way to go...",
    "literal": "Chrome seems to be minimalistic for the sake of being minimalistic, its almost as annoying as the super pushy tie-in to Google 'services'. \n\nTo me FF is where it's at."
  },
  {
    "ironic": "Oh sure, that speech is definitely going to ruin his chances if he decides to run...",
    "literal": "I highly doubt that speech will do him in if he runs."
  },
  {
    "ironic": "Oh sure, you're shocked... It's Mother Jones, after all...",
    "literal": "Are you surprised?    It's Mother Jones."
  },
  {
    "ironic": "Oh sure, that game you've been dying to get for 3 years is the perfect reason to buy a new console... Can't blame anyone for jumping on that super affordable deal... And obviously, those next-gen consoles are practically being given away... especially the xbone...",
    "literal": "The feeling of that game that you waited 3 years to get since it announcement kind of feeling makes people buy new consoles, can't blame them.  Though I don't see any lower price coming in 6 months except for the xbone.  Generally, this has been the cheapest next gen consoles."
  },
  {
    "ironic": "Oh sure, you must be right there... I'm sure a growing number of progressives are just thrilled about corporate welfare... I'd love to hear more of your fascinating insights on this...",
    "literal": "I think you might be wrong there.  I find that a growing number of progressives (maybe this is just withing my micro-chasm of the community) are very opposed to corporate welfare.  I'd like to hear all of your thoughts on this."
  },
  {
    "ironic": "Oh sure, calling it Obamacare really boosts the news source's credibility on the subject...",
    "literal": "The moment anyone calls it Obamacare, I feel like the news source lacks credibility on the subject."
  },
  {
    "ironic": "Oh sure, the people would be absolutely stunning in that world...",
    "literal": "Well, the people would on average be more attractive in that world"
  },
  {
    "ironic": "Oh sure, the Democrats are doing a bang-up job... They definitely know how to stay in the Senate come election time... Everyone who drank the grape kool-aid is totally oblivious to the impeccable Democrats who've done wonders for America in just 5 short years...",
    "literal": "The democrats keep shooting themselves in the foot.  Do they not know they will be out of the Senate come election time?  Almost everyone that drank the grape kool-aid is starting to wake up to the phony Democrats that have done so much harm to America in a short 5 years."
  },
  {
    "ironic": "Oh sure, this tactic is definitely protecting the rights of their minority... It's just wonderfully effective at hurting them more while dragging everyone else down with them...",
    "literal": "Yes but this tactic isn't protecting the rights of their minority.  It is hurting them more while taking everyone else with them."
  },
  {
    "ironic": "Oh sure, this isn't an alternative budget... It's just a delightful trip to an alternate universe where the South triumphed in 1865 and Republicans magically took over everything in 2012...",
    "literal": "&gt; This is not an alternative budget\n\nIt's an alternative history, the one where the South won back in 1865 and the Republicans swept the Senate and Presidency in 2012."
  },
  {
    "ironic": "Oh sure, you guys are absolutely serious... This is the most brilliant idea I've ever heard from any side... Just like when everyone said the same genius things about Medicare... And of course, Reagan's insightful 'socialized medicine' comments really nailed it...",
    "literal": "Are you people serious?   This is the dumbest thing I have seen from any side.   This is the same thing that was said about Medicare.   Reagan referred to socialized medicine to stop Medicare."
  },
  {
    "ironic": "Oh sure, the government is basically a charity...",
    "literal": "The government is not a charity."
  },
  {
    "ironic": "Oh sure, Obama, the Presidential disaster of the century...",
    "literal": "Obama, the Presidential train wreck."
  },
  {
    "ironic": "Oh sure, it was never burning... since the world's been turning...",
    "literal": "It was always burning\nSince the world's been turning"
  },
  {
    "ironic": "Oh sure, everyone will be lining up to bravely ask the WH about it...",
    "literal": "Now who is going to have the balls to ask the WH about it??"
  },
  {
    "ironic": "Oh sure, this would make me so happy... It sounds like they might move him to a later spot though... Honestly, if they were smart, they'd definitely keep him forever...",
    "literal": "This would make me so happy.  It sounds like they might move him to a later spot though.  Honestly if they were smart they'd just drop him."
  },
  {
    "ironic": "Oh sure, imagine a virus so considerate that it waits for you to be away, just to 3D print a lovely sculpture for you... how thoughtful...",
    "literal": "imagine if there was a virus that would wait until the computer is idle and 3d print a very detailed penis for you to find when you get back to your computer?"
  },
  {
    "ironic": "Oh sure, it completely restores those oh-so-necessary snap benefits...",
    "literal": "Does it restore much needed snap benefits?"
  },
  {
    "ironic": "Oh sure, it's a brilliant idea to give away billions every year instead of funding our much-needed social programs... because who needs those anyway, right?",
    "literal": "It's already on the books in New York, but the Democratic &amp; Republican politicians think it'd be better to give the billions of dollars back every year rather than fully funding our needed social programs."
  },
  {
    "ironic": "Oh sure, I just love listening to Limbaugh... he always nails it with his insightful points... This is definitely one of those times...",
    "literal": "I usually don't like listening to Limbaugh, but every now and then he articulates a point so perfectly.  This is one of those times."
  },
  {
    "ironic": "Oh sure, religion is thriving in America... it's not like anyone's bending beliefs to make them less ridiculous or anything. And obviously, nobody's just simplifying it down to a creator... all that other magical stuff is totally essential...",
    "literal": "I don't think it's necessarily dying in America, but I would say more individuals are bending the beliefs of religions  to not be so ridiculous.  There are exceptions, of course, but more people are starting to believe in just a creator.  Not all that other stuff."
  },
  {
    "ironic": "Oh sure, the author is a total genius... I'm completely amazed by how skillfully one can talk themselves into such blissful ignorance...",
    "literal": "The author is a twit.  I'm not sure how deluded and dense one must be to talk yourself into being so willfully ignorant."
  },
  {
    "ironic": "Oh sure, he's going to get center to right Catholics to think...",
    "literal": "I am just hoping he will get center to right Catholics to think."
  },
  {
    "ironic": "Oh sure, getting divorced would totally boost their career... When I was a kid going to a super-conservative Church of Christ, it was just wonderful when the preacher's wife ran off with a deacon's wife... No drama there at all...",
    "literal": "Because they're put up on a pedestal above their congregation, and if they got divorced, it would hurt their career. \n\nWhen I was a kid going to a super-conservative Church of Christ, it was a huge scandal because the preacher's wife ran off with a deacon's wife."
  },
  {
    "ironic": "Oh sure, it's perfectly fair to claim this is exclusively a republican game...",
    "literal": "Also, it's sort of intellectually dishonest to say this is a republican only game."
  },
  {
    "ironic": "Oh sure, everyone here provides such crystal-clear answers... it's not confusing at all... Seriously, what even is this thing, what on earth does it do, and how in the world am I supposed to use it?",
    "literal": "Everyone that answers this question responds with what they are doing - and it is more confusing than the thing itself.  What the fuck is the thing, what does it do, how do i use it?"
  },
  {
    "ironic": "Oh sure, everyone is *just handing out* rights left and right... They're definitely not forcing the state to acknowledge they already exist...",
    "literal": "Nobody is *giving* rights to anyone.   They are forcing the state to recognize that those rights exist."
  },
  {
    "ironic": "Oh sure, I'm just dying to know about this too...",
    "literal": "I'm curious about this as well."
  },
  {
    "ironic": "Oh sure, it's always been optional... I mean, when I swore into the AF in 1981, I just loved sitting there silently while everyone else chanted the god line... So comfortable... Definitely shouldn't be removed at all...",
    "literal": "It's always been optional.  I swore in to the AF in 1981 and remained silent as the group repeated the god line.   It still made me uncomfortable.  It should be removed altogether."
  },
  {
    "ironic": "Oh sure, I was absolutely thrilled to see McCain come out and totally praise him on that comparison...",
    "literal": "I was happy to see McCain come out and rip him on that comparison."
  },
  {
    "ironic": "Oh sure, these guys got elected to save the federal government... Any other claim is obviously the gospel truth...",
    "literal": "These guys *got elected* to destroy the federal government.  Any other professed objective is a lie."
  },
  {
    "ironic": "Oh sure, he's totally ready to go nuclear this time... just like last time...",
    "literal": "I hope he's more set to go nuclear then the last time he said he was set to go nuclear."
  },
  {
    "ironic": "Oh sure, I was totally expecting this to be from a well-respected news source... \n\nBut nope, there he is on video, confirming all our worst fears. \n\nHow much more honest and upstanding can these guys possibly get before their congregation(s) catch on...?",
    "literal": "I was hoping this was from The Onion, or someplace similar,. \n\nBut nope, there he is on video saying it. \n\nHow much more blatantly corrupt can these guys get before their congregation(s) realise what's going on?"
  },
  {
    "ironic": "Oh sure, his 'liberal eugenics' argument is a beacon of truth and wisdom... just like the tea party with their totally factual stories...",
    "literal": "Well, his \"liberal eugenics\" argument just firmly placed him in the same category as the tea party as he makes up shit that sounds scary and appeals to the uninformed."
  },
  {
    "ironic": "Oh sure, shutting down the government is a brilliant strategy... because who wouldn't want to rely on such a dependable system for healthcare...",
    "literal": "Maybe they just want to shut the government down and then say: \"Hey look!  A relatively small group of legislators just shut down the government.  Imagine if you depended on the government for healthcare. \""
  },
  {
    "ironic": "Oh sure, everyone is just thrilled in /r/conservative because a completely accurate article is being unfairly downvoted...",
    "literal": "And people are crying in /r/conservative because a misleading article is being downvoted. \n\nOk."
  },
  {
    "ironic": "Oh sure, they'd totally thrive if men weren't allowed to drive instead...",
    "literal": "They would probably drop through the floor if men weren't permitted to drive instead."
  },
  {
    "ironic": "Oh sure, it's definitely democracy... and not extortion at all... Wonderful job, Congress!",
    "literal": "I wouldn't say it's terrorism, but it IS extortion.   And it's not democracy.   \n\nRecall Congress!"
  },
  {
    "ironic": "Oh sure, she'll have so much impact as the chairman of the senate banking committee...",
    "literal": "She would have much more effect as the chairman of the senate banking committee."
  },
  {
    "ironic": "Oh sure, we have a flawless plan for who gets the money and when they magically stop getting it...",
    "literal": "who gets the money and how do you determine when they don't get anymore money?"
  },
  {
    "ironic": "Oh sure, the Republicans are just the best people ever...",
    "literal": "The Republicans can go fuck themselves."
  },
  {
    "ironic": "Oh sure, this would totally get 3000+ upvotes anywhere else...",
    "literal": "This would easily go 3000+ upvotes outside of this sub."
  },
  {
    "ironic": "Oh sure, Obama couldn't possibly give this speech because he absolutely despises American Exceptionalism...",
    "literal": "You want to know why Obama couldn't give this speech?  He doesn't believe in American Exceptionalism."
  },
  {
    "ironic": "Oh sure, those cheapest plans just hand out preventative services for free... And being buried under a mere 5-10k in medical debt is such a fantastic position compared to drowning in 100k-1million+ debt... because, you know, filing for bankruptcy is like a walk in the park...",
    "literal": "but even the cheapest plans offer preventative services for free.   And being 5-10k in medical debt is a much better position than being 100k-1million+ debt (which can be complicated to file for bankruptcy: http://www. nolo. com/legal-encyclopedia/medical-debt-chapter-7-bankruptcy. html)"
  },
  {
    "ironic": "Oh sure, if you kill someone, you absolutely deserve to die... It's that simple...",
    "literal": "/r/justiceporn\n\n\nIf you kill someone, you deserve to die.   It's that simple."
  },
  {
    "ironic": "Oh sure, this is exactly how the grey goo takes over...",
    "literal": "This is how the grey goo begins."
  },
  {
    "ironic": "Oh sure, if you tune into Fox News, there's absolutely loads of coverage on the shutdown... They’re totally diving deep into it... Apparently, a 'slim down' is their way of keeping us fully informed... Wonderful job, Fox News, just ignoring the biggest political story of the moment...",
    "literal": "Wow, if you got fox news there is no mention of this.  \n\nFox news does not even talk about the shutdown anywhere on their site.   \nThe closest they come they say something called a slim down, but that makes no sense.   So fox news is ignoring the main political story right now about the shutdown."
  },
  {
    "ironic": "Oh sure, Jillette's video has way more views because he's just light-years more famous than those other two... And of course, the opening claiming it hits a nerve is just wasted space... Absolutely nothing else could have contributed to its popularity...",
    "literal": "Jillette's video has so many more views because he is much, much more famous than the other two. \n\nInteresting article but the opening saying that it has more views because it hits a nerve is space that could have been used better."
  },
  {
    "ironic": "Oh sure... because confessions are never made under duress and every killer always gets a perfectly fair trial... Absolutely guaranteed...",
    "literal": "That's assuming of course the confession is not made under duress and the killer has a fair trial.    Neither of which is guaranteed."
  },
  {
    "ironic": "Oh sure... the government has all the rights... It's not like the constitution limits its powers to what the electorate grants or anything...",
    "literal": "The government has *no* rights.  The government, at least as the constitution spells out, only has powers granted by the electorate.  It has no \"right\" to any of those powers."
  },
  {
    "ironic": "Oh sure, the video is perfectly clear at first about atheists... and then it magically clears everything up by mixing anger at 'God' with anger at organized religion... because those are exactly the same thing, right?",
    "literal": "The video is a little sketchy at first in the way it refers to atheists but it goes on to clarify this point.   She goes from talking about anger at \"God\" to people who are angry at organized religion which are 2 completely different things."
  },
  {
    "ironic": "Oh sure, science and statistics are totally useless compared to Carl Rove's flawless intuition that Ohio would go for Romney... just a wild guess, but clearly 'your statistics mean nothing' was the genius mantra of the time...",
    "literal": "science and statistics, as opposed to carl rove blindly believing that ohio would go for romney.  just guessing though, but there was a lot of 'your statistics mean nothing' going around at the time."
  },
  {
    "ironic": "Oh sure, they're doing their best to keep local elections completely honest and fair...",
    "literal": "Doing their best to overwhelm and corrupt local elections."
  },
  {
    "ironic": "Oh sure, she's 'quiet'... because there are just endless news stories about Warren compared to Hilary these days...",
    "literal": "She's \"quiet\"?  I've seen so many more news stories about Warren than about Hilary in recent years."
  },
  {
    "ironic": "Oh sure, let's call it 'civil'... like when you're in a car with someone who’s joyfully speeding towards a cliff, fully planning to fly off unless you happily surrender all your demands... Sounds perfectly reasonable...",
    "literal": "It's not.  \n\nIt'd be like calling a debate 'civil' if you were in a car with someone and they were speeding towards a cliff with the intent of going over the cliff if you didn't accept all of their demands and give up yours."
  },
  {
    "ironic": "Oh sure, Feinstein is a total genius, and her 'reforms' are bound to be absolute masterpieces...",
    "literal": "Feinstein is a complete tool, any \"reforms\" from her are likely utter rubbish."
  },
  {
    "ironic": "Oh sure, it's absolutely hilarious how you can turn amazing things into a complete disaster...",
    "literal": "It's ~~funny~~ depressing how bad you can make good things sound."
  },
  {
    "ironic": "Oh sure, I posted this clip here months ago and it was showered with upvotes...",
    "literal": "I posted this clip here months ago and was downvoted to oblivion."
  },
  {
    "ironic": "Oh sure, let's 'restore the economy' by blowing up the finance sector...",
    "literal": "How do we have \"restore the economy\" and \"blow up the finance sector\"\nin the same headline?"
  },
  {
    "ironic": "Oh sure, having a copy of your wallet after your bitcoins are stolen is just as useful as a lovely photograph of your coins after someone kindly emptied your account...",
    "literal": "A copy of your wallet after your bitcoins have been stolen is like a photograph of your coins after someone took your money."
  },
  {
    "ironic": "Oh sure, all I can think of is Red Faction Guerrilla when I look at this... because who wouldn't want one now...",
    "literal": "All i can think of is Red Faction Guerrilla when i look at this.  Either way i want one now."
  },
  {
    "ironic": "Oh sure, that sounds exactly like Catholicism...",
    "literal": "Sounds like the complete opposite of Catholicism."
  },
  {
    "ironic": "Oh sure, Paxman barely mentioned Russell's not voting stance... and calling him 'trivial'? That was definitely a compliment...",
    "literal": "I don't think so.   Firstly, Paxman lingered way too long on Russell's not voting position for that to have been the case.   And secondly, at one point, he even called Russell a \"trivial\" person."
  },
  {
    "ironic": "Oh sure, the left's completely rational love for Walmart is just so understandable...",
    "literal": "The left's irrational hatred of Walmart is comical to me."
  }
]